hevet/ESP32-MiniWebRadio/src/common.h
// created: 10.02.2022
// updated: 23.11.2025

#pragma once

#define _SSID             "mySSID"         // Your WiFi credentials here
#define _PW               "myWiFiPassword" // Or in textfile on SD-card
#define TFT_CONTROLLER    5                // (0)ILI9341, (3)ILI9486, (4)ILI9488, (5)ST7796, (7) RGB display
#define DISPLAY_INVERSION 0                // only SPI displays, (0) off (1) on
#define TFT_ROTATION      1                // only SPI displays, 1 or 3 (landscape)
#define TFT_FREQUENCY     40000000         // only SPI displays, 80000000, 40000000, 27000000, 20000000, 10000000
#define TP_VERSION        5                // only SPI displays, (0)ILI9341, (3)ILI9486, (4)ILI9488, (5)ST7796, (7)GT911
#define TP_ROTATION       1                // only SPI displays, 1 or 3 (landscape)
#define TP_H_MIRROR       0                // only SPI displays, (0) default, (1) mirror up <-> down
#define TP_V_MIRROR       0                // only SPI displays, (0) default, (1) mittor left <-> right
#define LIGHT_SENSOR      1                // (0) none, (1) BH1750
#define I2S_COMM_FMT      0                // (0) MAX98357A PCM5102A CS4344, (1) LSBJ (Least Significant Bit Justified format) PT8211
#define SDMMC_FREQUENCY   80000000         // 80000000 or 40000000 Hz
#define FTP_USERNAME      "esp32"          // user name in FTP Client
#define FTP_PASSWORD      "esp32"          // pw in FTP Client
#define CONN_TIMEOUT      2500             // unencrypted connection timeout in ms (http://...)
#define CONN_TIMEOUT_SSL  3500             // encrypted connection timeout in ms (https://...)
#define WIFI_TX_POWER     5                // 2 ... 21 (dBm) Adjust the WiFi transmission power to optimise power consumption or increase range, default: 5
#define LIST_TIMER        5                // After this time (seconds), the display returns from the list view
// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

#include "Audio.h"
#include "BH1750.h"
#include "DLNAClient.h"
#include "ESP32FtpServer.h"
#include "IR.h"
#include "SPIFFS.h"
#include "base64.h"
#include "esp_log.h"
#include "kcx_bt_emitter.h"
#include "mbedtls/sha1.h"
#include "rtime.h"
#include "tft_rgb.h"
#include "tft_spi.h"
#include "tp_gt911.h"
#include "tp_xpt2046.h"
#include "websrv.h"
#include <Arduino.h>
#include <ArduinoOTA.h>
#include <ESPmDNS.h>
#include <FFat.h>
#include <FS.h>
#include <Preferences.h>
#include <SD_MMC.h>
#include <SPI.h>
#include <Ticker.h>
#include <WiFiClient.h>
#include <WiFiClientSecure.h>
#include <WiFiMulti.h>
#include <Wire.h>
#include <mbedtls/aes.h>
#include <mbedtls/base64.h>
#include <vector>

#if TFT_CONTROLLER < 7
    #if CONFIG_IDF_TARGET_ESP32S3
    // Digital I/O used
        #define TFT_CS             8
        #define TFT_DC             12
        #define TFT_BL             10 // at -1 the brightness menu is not displayed
        #define TP_IRQ             39
        #define TP_CS              15
        #define SD_MMC_D0          11
        #define SD_MMC_CLK         13
        #define SD_MMC_CMD         14
        #define IR_PIN             4  // IR Receiver (if available)
        #define TFT_MOSI           18 // TFT and TP (FSPI)
        #define TFT_MISO           2  // TFT and TP (FSPI)
        #define TFT_SCK            17 // TFT and TP (FSPI)
        #define I2S_DOUT           9
        #define I2S_BCLK           3
        #define I2S_LRC            1
        #define I2S_MCLK           0
        #define BT_EMITTER_RX      45 // TX pin - KCX Bluetooth Transmitter    (-1 if not available)
        #define BT_EMITTER_TX      38 // RX pin - KCX Bluetooth Transmitter    (-1 if not available)
        #define BT_EMITTER_MODE    20 // high transmit - low receive           (-1 if not available)
        #define BT_EMITTER_CONNECT 48 // high impulse -> awake after POWER_OFF (-1 if not available)
        #define I2C_SDA            41 // I2C, dala line for capacitive touchpad
        #define I2C_SCL            42 // I2C, clock line for capacitive touchpad
        #define AMP_ENABLED        -1 // onboard amplifier                     (-1 if not available)
    #endif
    #if CONFIG_IDF_TARGET_ESP32P4
        #define TFT_CS             26
        #define TFT_DC             3
        #define TFT_BL             4 // at -1 the brightness menu is not displayed
        #define TP_IRQ             5
        #define TP_CS              2
        #define SD_MMC_D0          39
        #define SD_MMC_D1          40
        #define SD_MMC_D2          41
        #define SD_MMC_D3          42
        #define SD_MMC_CLK         43
        #define SD_MMC_CMD         44
        #define IR_PIN             32 // IR Receiver (if available)
        #define TFT_MOSI           20 // TFT and TP (FSPI)
        #define TFT_MISO           21 // TFT and TP (FSPI)
        #define TFT_SCK            22 // TFT and TP (FSPI)
        #define I2S_DOUT           23
        #define I2S_BCLK           24
        #define I2S_LRC            25
        #define I2S_MCLK           -1
        #define BT_EMITTER_RX      27 // TX pin - KCX Bluetooth Transmitter    (-1 if not available)
        #define BT_EMITTER_TX      28 // RX pin - KCX Bluetooth Transmitter    (-1 if not available)
        #define BT_EMITTER_MODE    29 // high transmit - low receive           (-1 if not available)
        #define BT_EMITTER_CONNECT 30 // high impulse -> awake after POWER_OFF (-1 if not available)
        #define I2C_SDA            7  // I2C, dala line for capacitive touchpad
        #define I2C_SCL            8  // I2C, clock line for capacitive touch
        #define AMP_ENABLED        33 // onboard amplifier                     (-1 if not available)
    // free pins 46, 47, 48, 49, 50, 51, 52
    #endif // CONFIG_IDF_TARGET_ESP32P4
#endif     // CONFIG_IDF_TARGET_ESP32S3

#if TFT_CONTROLLER == 7 // RGB display
    #if CONFIG_IDF_TARGET_ESP32S3
const TFT_RGB::Pins RGB_PINS = { // SUNTON 7"
    .b0 = 15, .b1 = 7,  .b2 = 6,  .b3 = 5,  .b4 = 4,  .g0 = 9,     .g1 = 46,    .g2 = 3,  .g3 = 8,    .g4 = 16, .g5 = 1,
    .r0 = 14, .r1 = 21, .r2 = 47, .r3 = 48, .r4 = 45, .hsync = 39, .vsync = 40, .de = 41, .pclk = 42, .bl = 2};

const TFT_RGB::Timing RGB_TIMING = {.h_res = 800,
                                    .v_res = 480,
                                    .pixel_clock_hz = 10000000,
                                    .hsync_pulse_width = 30,
                                    .hsync_back_porch = 16,
                                    .hsync_front_porch = 210,
                                    .vsync_pulse_width = 13,
                                    .vsync_back_porch = 10,
                                    .vsync_front_porch = 22};

