hevet/ESP32-MiniWebRadio/src/common.h
        #define TP_SDA             19
        #define TP_SCL             20
        #define TP_IRQ             -1
        #define SD_MMC_CMD         11
        #define SD_MMC_CLK         12
        #define SD_MMC_D0          13
        #define I2C_MASTER_FREQ_HZ 400000 // 400 kHz I2C-frequency
        #define GT911_I2C_ADDRESS  0x5D   // default I2C-address of GT911
        #define I2S_DOUT           17
        #define I2S_BCLK           0
        #define I2S_LRC            18
        #define I2S_MCLK           -1 // important!
        #define IR_PIN             38 // IR Receiver (if available)
        #define BT_EMITTER_RX      -1 // must be -1, not enough pins
        #define BT_EMITTER_TX      -1 // must be -1, not enough pins
        #define BT_EMITTER_MODE    -1 // must be -1, not enough pins
        #define BT_EMITTER_CONNECT -1 // must be -1, not enough pins
        #define TFT_BL             2  // same as RGB_PINS.bl
        #define I2C_SDA            -1 //   19 // I2C line, same as dala line for capacitive touchpad  (-1 if not used) can be used for brightness sensor
        #define I2C_SCL            -1 //   20 // I2C line, same as clock line for capacitive touchpad (-1 if not used) can be used for brightness sensor
        #define AMP_ENABLED        -1 // onboard amplifier (-1 if not available)
    #endif // CONFIG_IDF_TARGET_ESP32S3
    #if CONFIG_IDF_TARGET_ESP32P4
    // todo
    #endif
#endif

// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
//  output on serial terminal
#define ANSI_ESC_RESET "\033[0m"

#define ANSI_ESC_BLACK        "\033[30m"
#define ANSI_ESC_RED          "\033[31m"
#define ANSI_ESC_GREEN        "\033[32m"
#define ANSI_ESC_YELLOW       "\033[33m"
#define ANSI_ESC_BLUE         "\033[34m"
#define ANSI_ESC_MAGENTA      "\033[35m"
#define ANSI_ESC_CYAN         "\033[36m"
#define ANSI_ESC_WHITE        "\033[37m"
#define ANSI_ESC_BG_BLACK     "\033[40m"
#define ANSI_ESC_BG_RED       "\033[41m"
#define ANSI_ESC_BG_GREEN     "\033[42m"
#define ANSI_ESC_BG_YELLOW    "\033[43m"
#define ANSI_ESC_BG_BLUE      "\033[44m"
#define ANSI_ESC_BG_MAGENTA   "\033[45m"
#define ANSI_ESC_BG_CYAN      "\033[46m"
#define ANSI_ESC_BG_WHITE     "\033[47m"
#define ANSI_ESC_GREY         "\033[90m"
#define ANSI_ESC_LIGHTRED     "\033[91m"
#define ANSI_ESC_LIGHTGREEN   "\033[92m"
#define ANSI_ESC_LIGHTYELLOW  "\033[93m"
#define ANSI_ESC_LIGHTBLUE    "\033[94m"
#define ANSI_ESC_LIGHTMAGENTA "\033[95m"
#define ANSI_ESC_LIGHTCYAN    "\033[96m"
#define ANSI_ESC_LIGHTGREY    "\033[97m"
#define ANSI_ESC_DARKRED      "\033[38;5;52m"
#define ANSI_ESC_DARKGREEN    "\033[38;5;22m"
#define ANSI_ESC_DARKYELLOW   "\033[38;5;136m"
#define ANSI_ESC_DARKBLUE     "\033[38;5;17m"
#define ANSI_ESC_DARKMAGENTA  "\033[38;5;53m"
#define ANSI_ESC_DARKCYAN     "\033[38;5;23m"
#define ANSI_ESC_DARKGREY     "\033[38;5;240m"
#define ANSI_ESC_BROWN        "\033[38;5;130m"
#define ANSI_ESC_ORANGE       "\033[38;5;214m"
#define ANSI_ESC_DARKORANGE   "\033[38;5;166m"
#define ANSI_ESC_LIGHTORANGE  "\033[38;5;215m"
#define ANSI_ESC_PURPLE       "\033[38;5;129m"
#define ANSI_ESC_PINK         "\033[38;5;213m"
#define ANSI_ESC_LIME         "\033[38;5;190m"
#define ANSI_ESC_NAVY         "\033[38;5;25m"
#define ANSI_ESC_AQUAMARINE   "\033[38;5;51m"
#define ANSI_ESC_LAVENDER     "\033[38;5;189m"
#define ANSI_ESC_LIGHTBROWN   "\033[38;2;210;180;140m"
#define ANSI_ESC_RESET        "\033[0m"
#define ANSI_ESC_BOLD         "\033[1m"
#define ANSI_ESC_FAINT        "\033[2m"
#define ANSI_ESC_ITALIC       "\033[3m"
#define ANSI_ESC_UNDERLINE    "\033[4m"
#define ANSI_ESC_BLINK        "\033[5m"
#define ANSI_ESC_INVERT       "\033[7m"
#define ANSI_ESC_STRIKE       "\033[9m"

// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
struct _emojis {
    const char greenCircle[5] = {0xF0, 0x9F, 0x9F, 0xA2, 0x00};  // UTF-8: "🟢"
    const char yellowCircle[5] = {0xF0, 0x9F, 0x9F, 0xA1, 0x00}; // UTF-8: "🟡"
    const char redCircle[5] = {0xF0, 0x9F, 0x94, 0xB4, 0x00};    // UTF-8: "🔴"
    const char blueCircle[5] = {0xF0, 0x9F, 0x94, 0xB5, 0x00};   // UTF-8: "🔵"
    const char orangeCircle[5] = {0xF0, 0x9F, 0x9F, 0xA0, 0x00}; // UTF-8: "🟠"
    const char purpleCircle[5] = {0xF0, 0x9F, 0x9F, 0xA3, 0x00}; // UTF-8: "🟣"
    const char brownCircle[5] = {0xF0, 0x9F, 0x9F, 0xA4, 0x00};  // UTF-8: "🟤"
    const char greenSquare[5] = {0xF0, 0x9F, 0x9F, 0xA9, 0x00};  // UTF-8: "🟩"
    const char yellowSquare[5] = {0xF0, 0x9F, 0x9F, 0xA8, 0x00}; // UTF-8: "🟨"
    const char redSquare[5] = {0xF0, 0x9F, 0x9F, 0xA5, 0x00};    // UTF-8: "🟥"
    const char blueSquare[5] = {0xF0, 0x9F, 0x9F, 0xA6, 0x00};   // UTF-8: "🟦"
    const char orangeSquare[5] = {0xF0, 0x9F, 0x9F, 0xA7, 0x00}; // UTF-8: "🟧"
    const char purpleSquare[5] = {0xF0, 0x9F, 0x9F, 0xAA, 0x00}; // UTF-8: "🟪"
    const char brownSquare[5] = {0xF0, 0x9F, 0x9F, 0xAB, 0x00};  // UTF-8: "🟫"
} emoji;
// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

enum status {
    NONE = 0,
    RADIO = 1,
    PLAYER = 2,
    DLNA = 3,
    CLOCK = 4,
    BRIGHTNESS = 5,
    ALARMCLOCK = 6,
    SLEEPTIMER = 7,
    STATIONSLIST = 8,
    AUDIOFILESLIST = 9,
    DLNAITEMSLIST = 10,
    BLUETOOTH = 11,
    EQUALIZER = 12,
    SETTINGS = 13,
    IR_SETTINGS = 14,
    RINGING = 15,
    WIFI_SETTINGS = 16,
    UNDEFINED = 255
};

static bool                     newLine = false;
extern SemaphoreHandle_t        mutex_rtc;
extern RTIME                    rtc;
extern WebSrv                   webSrv;
extern std::deque<ps_ptr<char>> s_logBuffer;

void SerialPrintfln(const char* fmt, ...) {
    ps_ptr<char> myLog;
    if (newLine) {
        newLine = false;
        myLog.assign("\n");
    } else {
        myLog.assign("");
    }
    rtc.hasValidTime() ? myLog.append(rtc.gettime_s()) : myLog.append("00:00:00");
    myLog.append(" ");
    va_list args;
    va_start(args, fmt);
    myLog.appendf_va(fmt, args);
    va_end(args);
    myLog.append("\033[0m\r\n");
    Serial.printf("%s", myLog.c_get());
    s_logBuffer.insert(s_logBuffer.begin(), std::move(myLog)); // send to webSrv in loop()
    myLog.reset();
}

