hevet/ESP32-MiniWebRadio/src/common.h
void SerialPrintfcr(const char* fmt, ...) {
    if (s_logBuffer.size() == 1024) s_logBuffer.pop_back();
    ps_ptr<char> myLog;
    rtc.hasValidTime() ? myLog.assign(rtc.gettime_s()) : myLog.assign("00:00:00");
    myLog.append(" ");
    va_list args;
    va_start(args, fmt);
    myLog.appendf_va(fmt, args);
    va_end(args);
    myLog.append("\033[0m\r");
    Serial.printf("%s", myLog.c_get());
    s_logBuffer.insert(s_logBuffer.begin(), std::move(myLog)); // send to webSrv in loop()
    myLog.reset();
    newLine = true;
}

int log_redirect_handler(const char* format, va_list args) {
    int len = vsnprintf(nullptr, 0, format, args) + 1;
    // Puffer für die formatierte Nachricht
    ps_ptr<char> log_buffer;
    log_buffer.alloc(len);
    vsnprintf(log_buffer.get(), len, format, args);
    if (len > 0) {
        int idx = log_buffer.index_of("ARDUINO:");
        if (idx > 0) {
            char c = log_buffer[7];
            log_buffer.remove_before(idx, true);
            log_buffer.insert("    ", 8);
            if (c == 'E') log_buffer.insert(ANSI_ESC_RED, 10);
            if (c == 'W') log_buffer.insert(ANSI_ESC_YELLOW, 10);
            if (c == 'I') log_buffer.insert(ANSI_ESC_GREEN, 10);
            if (c == 'D') log_buffer.insert(ANSI_ESC_CYAN, 10);
            if (c == 'V') log_buffer.insert(ANSI_ESC_GREY, 10);
            log_buffer.truncate_at(log_buffer.strlen() - 1); // remove '\n'
            SerialPrintfln("%s", log_buffer.c_get());
        } else {
            SerialPrintfln("%s", log_buffer.c_get());
        }
    }
    return 0;
}

// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
struct dlnaHistory_s {
    ps_ptr<char> objId;
    ps_ptr<char> name;
    uint16_t     maxItems = 0;
};
struct releasedArg {
    char*   arg1 = NULL;
    char*   arg2 = NULL;
    char*   arg3 = NULL;
    int16_t val1 = 0;
    int16_t val2 = 0;
};
struct timecounter_s {
    uint8_t timer = 0;
    uint8_t factor = 2;
};
struct irButtons {
    int16_t val;
    char*   label;
};
struct settings_s {
    irButtons    irbuttons[45];
    uint8_t      numOfIrButtons = 0;
    ps_ptr<char> lastconnectedhost = {};
    ps_ptr<char> lastconnectedfile = {};
};

struct volume_s {
    uint8_t cur_volume = 21;
    uint8_t ringVolume = 21;
    uint8_t volumeAfterAlarm = 12;
    uint8_t volumeSteps = 21;
    uint8_t volumeCurve = 1;
};

struct bt_emitter_s {
    bool         found = false;
    bool         connect = false;
    bool         power_state = false;
    bool         play = true; // play: true, pause: false
    uint8_t      volume = 0;
    ps_ptr<char> mode = {};
    ps_ptr<char> version = {};
};

struct tone_s {
    int16_t LP = 0;  // -40 ... +6 (dB)        audioI2S
    int16_t BP = 0;  // -40 ... +6 (dB)        audioI2S
    int16_t HP = 0;  // -40 ... +6 (dB)        audioI2S
    int16_t BAL = 0; // -16...0....+16         audioI2S
};

// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

// prototypes (main.cpp)
bool         SD_MMC_exists(const char* path);
boolean      defaultsettings();
void         updateSettings();
void         urldecode(char* str);
void         setTFTbrightness(uint8_t duty);
void         fall_asleep();
void         wake_up();
void         setRTC(ps_ptr<char> TZString);
boolean      isAlarm(uint8_t weekDay, uint8_t alarmDays, uint16_t minuteOfTheDay, int16_t* alarmTime);
boolean      copySDtoFFat(const char* path);
void         showStreamTitle(ps_ptr<char> streamTitle);
void         showLogoAndStationName(bool force);
void         showFileLogo(uint8_t state);
void         showFileName(const char* fname);
void         showPlsFileNumber();
void         showAudioFileNumber();
void         display_sleeptime(int8_t ud = 0);
boolean      drawImage(const char* path, uint16_t posX, uint16_t posY, uint16_t maxWidth = 0, uint16_t maxHeigth = 0);
boolean      isAudio(File file);
boolean      isAudio(const char* path);
boolean      isPlaylist(File file);
bool         connectToWiFi();
void         setWiFiCredentials(const char* ssid, const char* password);
ps_ptr<char> scaleImage(ps_ptr<char> path);
void         setVolume(uint8_t vol);
uint8_t      downvolume();
uint8_t      upvolume();
void         setStation(uint16_t sta);
const char*  getFlagPath(uint16_t station);
void         nextStation();
void         prevStation();
void         setStationByNumber(uint16_t staNr);
void         StationsItems();
void         setStationViaURL(const char* url, const char* extension);
void         savefile(ps_ptr<char> fileName, uint32_t contentLength, ps_ptr<char> contenttype);
ps_ptr<char> setI2STone();
void         SD_playFile(ps_ptr<char> pathWoFileName, const char* fileName);
void         SD_playFile(ps_ptr<char> path, uint32_t resumeFilePos = 0, bool showFN = true);
bool         SD_rename(const char* src, const char* dest);
bool         SD_newFolder(const char* folderPathName);
bool         SD_delete(const char* itemPath);
bool         preparePlaylistFromDLNAFolder();
bool         preparePlaylistFromFile(const char* path);
bool         preparePlaylistFromSDFolder(const char* path);
void         sortPlayListAlphabetical();
void         sortPlayListRandom();
void         processPlaylist(boolean first = false);
void         changeState(int32_t state);
void         connecttohost(ps_ptr<char> host);
void         connecttoFS(const char* FS, const char* filename, uint32_t fileStartTime = 0);
void         stopSong();
void         placingGraphicObjects();
void         muteChanged(bool m);
void         setTimeCounter(uint8_t sec);
ps_ptr<char> get_WiFi_PW(const char* ssid);
void         my_audio_info(Audio::msg_t m);
void         on_dlna_client(const DLNA_Client::msg_s& msg);
void         on_kcx_bt_emitter(const KCX_BT_Emitter::msg_s& msg);
void         on_websrv(const WebSrv::msg_s& msg);

// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

inline const char* byte_to_binary(int8_t x) { // e.g. alarmdays
    static char b[9];
    b[0] = '\0';

