hevet/ESP32-MiniWebRadio/src/common.h
    int32_t z;
    for (z = 128; z > 0; z >>= 1) { strcat(b, ((x & z) == z) ? "1" : "0"); }
    return b;
}
// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

inline uint32_t simpleHash(const char* str) {
    if (str == NULL) return 0;
    uint32_t hash = 0;
    for (int32_t i = 0; i < strlen(str); i++) {
        if (str[i] < 32) continue; // ignore control sign
        hash += (str[i] - 31) * i * 32;
    }
    return hash;
}
// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

inline int32_t str2int(const char* str) {
    int32_t len = strlen(str);
    if (len > 0) {
        for (int32_t i = 0; i < len; i++) {
            if (!isdigit(str[i])) {
                log_e("NaN");
                return 0;
            }
        }
        return stoi(str);
    }
    return 0;
}

// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

inline char* int2str(int32_t val) {
    static char ret[12];
    itoa(val, ret, 10);
    return ret;
}
// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

inline void trim(char* s) {
    // fb   trim in place
    char* pe;
    char* p = s;
    while (isspace(*p)) p++; // left
    pe = p;                  // right
    while (*pe != '\0') pe++;
    do { pe--; } while ((pe > p) && isspace(*pe));
    if (p == s) {
        *++pe = '\0';
    } else { // move
        while (p <= pe) *s++ = *p++;
        *s = '\0';
    }
}
// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

inline bool startsWith(const char* base, const char* searchString) {
    if (base == NULL) {
        log_e("base = NULL");
        return false;
    } // guard
    if (searchString == NULL) {
        log_e("searchString == NULL");
        return false;
    } // guard
    if (strlen(searchString) > strlen(base)) return false;
    char c;
    while ((c = *searchString++) != '\0')
        if (c != *base++) return false;
    return true;
}
// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

inline bool endsWith(const char* base, const char* searchString) {
    if (base == NULL) {
        log_e("base = NULL");
        return false;
    } // guard
    if (searchString == NULL) {
        log_e("searchString == NULL");
        return false;
    } // guard
    int32_t slen = strlen(searchString);
    if (slen == 0) return false;
    const char* p = base + strlen(base);
    //  while(p > base && isspace(*p)) p--;  // rtrim
    p -= slen;
    if (p < base) return false;
    return (strncmp(p, searchString, slen) == 0);
}
// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

inline int32_t indexOf(const char* haystack, const char* needle, int32_t startIndex) {
    const char* p = haystack;
    for (; startIndex > 0; startIndex--)
        if (*p++ == '\0') return -1;
    const char* pos = strstr(p, needle);
    if (pos == nullptr) return -1;
    return pos - haystack;
}
// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
inline int32_t lastIndexOf(const char* haystack, const char needle) {
    const char* p = strrchr(haystack, needle);
    return (p ? p - haystack : -1);
}
// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
inline int rfind(const char* str, char ch, int start = -1) { // same as indexof() burt from right to left
    if (!str) return -1;                                     // if str is NULL
    int len = strlen(str);
    if (start == -1 || start >= len) start = len - 1; // Default: Search from the end of the string

    for (int i = start; i >= 0; --i) {
        if (str[i] == ch) return i; // character found
    }
    return -1; // character not found
}
// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
inline int replacestr(char* line, const char* search, const char* replace) { /* returns number of strings replaced.*/
    int   count = 0;
    char* sp; // start of pattern
    // printf("replacestr(%s, %s, %s)\n", line, search, replace);
    if ((sp = strstr(line, search)) == NULL) { return (0); }
    count = 1;
    int sLen = strlen(search);
    int rLen = strlen(replace);
    if (sLen > rLen) {
        // move from right to left
        char* src = sp + sLen;
        char* dst = sp + rLen;
        while ((*dst = *src) != '\0') {
            dst++;
            src++;
        }
    } else if (sLen < rLen) {
        // move from left to right
        int   tLen = strlen(sp) - sLen;
        char* stop = sp + rLen;
        char* src = sp + sLen + tLen;
        char* dst = sp + rLen + tLen;
        while (dst >= stop) {
            *dst = *src;
            dst--;
            src--;
        }
    }
    memcpy(sp, replace, rLen);
    count += replacestr(sp + rLen, search, replace);
    return (count);
}

// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

inline char* x_ps_malloc(uint16_t len) {
    char* ps_str = NULL;
    if (psramFound()) { ps_str = (char*)ps_malloc(len); }
    if (!ps_str) { ps_str = (char*)malloc(len); }
    if (!ps_str) { log_e("oom"); }
    return ps_str;
}
// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

inline char* x_ps_calloc(uint16_t len, uint8_t size) {
    char* ps_str = NULL;
    if (psramFound()) { ps_str = (char*)ps_calloc(len, size); }
    if (!ps_str) { ps_str = (char*)calloc(len, size); }
    if (!ps_str) { log_e("oom"); }
    return ps_str;
}
// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

inline char* x_ps_strdup(const char* str) {
    if (!str) {
        log_e("str is NULL");
        return NULL;
    }
    char* ps_str = NULL;
    if (psramFound()) { ps_str = (char*)ps_malloc(strlen(str) + 1); }
    if (!ps_str) { ps_str = (char*)malloc(strlen(str) + 1); }
    if (!ps_str) {
        log_e("oom");
        return NULL;
    }
    strcpy(ps_str, str);
    return ps_str;
}
// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

