hevet/ESP32-MiniWebRadio/src/common.h
inline char* x_ps_strndup(const char* str, uint16_t n) { // with '\0' termination
    if (!str) {
        log_e("str is NULL");
        return NULL;
    }
    char* ps_str = NULL;
    if (psramFound()) { ps_str = (char*)ps_malloc(n + 1); }
    if (!ps_str) { ps_str = (char*)malloc(n + 1); }
    if (!ps_str) {
        log_e("oom");
        return NULL;
    }
    strncpy(ps_str, str, n);
    ps_str[n] = '\0';
    return ps_str;
}
// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

int find_first_of(const char* source, const char* delimiters, int start = 0) {
    for (int i = start; source[i] != '\0'; ++i) {     // search at start
        for (int j = 0; delimiters[j] != '\0'; ++j) { // search delimiters
            if (source[i] == delimiters[j]) {
                return i; // position of first found delimiter
            }
        }
    }
    return -1; // not found
}
// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

inline int16_t strlenUTF8(const char* str) { // returns only printable glyphs, all ASCII and UTF-8 until 0xDFBD
    if (str == NULL) return -1;
    uint16_t idx = 0;
    uint16_t cnt = 0;
    while (*(str + idx) != '\0') {
        if ((*(str + idx) < 0xC0) && (*(str + idx) > 0x1F)) cnt++;
        if ((*(str + idx) == 0xE2) && (*(str + idx + 1) == 0x80)) cnt++; // general punctuation
        idx++;
    }
    return cnt;
}
// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

inline int32_t map_l(int32_t x, int32_t in_min, int32_t in_max, int32_t out_min, int32_t out_max) {
    const int32_t run = in_max - in_min;
    if (run == 0) {
        log_e("map(): Invalid input range, %li == %li (min == max)", in_min, in_max);
        return -1; // AVR returns -1, SAM returns 0
    }
    const int32_t rise = out_max - out_min;
    const int32_t delta = x - in_min;
    return round((delta * rise) / run + out_min);
}
// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

inline void SerialPrintflnCut(const char* item, const char* color, const char* str) {
    uint8_t maxLength = 100;
    if (strlen(str) > maxLength) {
        String f = str;
        SerialPrintfln("%s%s%s ... %s", item, color, f.substring(0, maxLength - 25).c_str(), f.substring(f.length() - 20, f.length()).c_str());
    } else {
        SerialPrintfln("%s%s%s", item, color, str);
    }
}
// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
#if TFT_CONTROLLER < 7 // ⏹⏹⏹⏹
extern TFT_SPI tft;
#else
extern TFT_RGB tft;
#endif

inline void x_ps_free(char** b) {
    if (*b) {
        free(*b);
        *b = NULL;
    }
}
inline void x_ps_free(unsigned char** b) {
    if (*b) {
        free(*b);
        *b = NULL;
    }
}
// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
inline void vector_clear_and_shrink(vector<char*>& vec) {
    uint size = vec.size();
    for (int32_t i = 0; i < size; i++) { x_ps_free(&vec[i]); }
    vec.clear();
    vec.shrink_to_fit();
}

// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
class RegisterTable {
  public:
    virtual ps_ptr<char> getName() = 0;
    virtual bool         isEnabled() = 0;
    virtual void         disable() = 0;
    virtual bool         positionXY(uint16_t, uint16_t) = 0;
    virtual ~RegisterTable() {}
};
static std::vector<RegisterTable*> registertable_objects;
static void                        register_object(RegisterTable* obj) {
    registertable_objects.push_back(obj);
}
inline void get_registered_names() {
    for (auto obj : registertable_objects) {
        printf(ANSI_ESC_WHITE "    registered object:" ANSI_ESC_YELLOW " %-17s" ANSI_ESC_WHITE " is enabled: %-5s" ANSI_ESC_RESET, "\n", obj->getName().c_get(),
               obj->isEnabled() ? ANSI_ESC_RED "yes" : ANSI_ESC_BLUE "no");
    }
}
inline void disableAllObjects() {
    for (auto obj : registertable_objects) { obj->disable(); }
}
inline const char* isObjectClicked(uint16_t x, uint16_t y) {
    static char objName[100];
    objName[0] = '\0';
    for (auto obj : registertable_objects) {
        if (obj->isEnabled() && obj->positionXY(x, y)) {
            if (strlen(objName) > 0) strcat(objName, ", ");
            strcat(objName, obj->getName().get());
        }
    }
    return objName;
}
// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// Macro for comfortable calls
#define MWR_LOG_ERROR(fmt, ...)   Audio::AUDIO_LOG_IMPL(1, __FILE__, __LINE__, fmt, ##__VA_ARGS__)
#define MWR_LOG_WARN(fmt, ...)    Audio::AUDIO_LOG_IMPL(2, __FILE__, __LINE__, fmt, ##__VA_ARGS__)
#define MWR_LOG_INFO(fmt, ...)    Audio::AUDIO_LOG_IMPL(3, __FILE__, __LINE__, fmt, ##__VA_ARGS__)
#define MWR_LOG_DEBUG(fmt, ...)   Audio::AUDIO_LOG_IMPL(4, __FILE__, __LINE__, fmt, ##__VA_ARGS__)
#define MWR_LOG_VERBOSE(fmt, ...) Audio::AUDIO_LOG_IMPL(5, __FILE__, __LINE__, fmt, ##__VA_ARGS__)
